# Bonus - Import to Pandas and Graph

In [2]:
# Import dependencies
import matplotlib.pyplot as plt
from scipy import stats
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

from config import login

In [5]:
# Connect to DB
db_url = 'postgresql://' + login + '@localhost:5432/employees_db'
engine = create_engine(db_url)
connection = engine.connect()

In [7]:
#Create a histogram to visualize the most common salary ranges for employees.

# Get data from DB
salary_data = pd.read_sql("SELECT salary FROM salaries", connection)
salary_data.head()

   salary
0   60117
1   65828
2   40006
3   40054
4   78228

In [10]:
#Create a bar chart of average salary by title.

# write query
sql_query = 'SELECT t.title, round(avg(s.salary)) AS "Average Salary"\
FROM salaries s \
LEFT JOIN employees e \
ON e.emp_no = s.emp_no \
LEFT JOIN titles t \
ON e.emp_title_id = t.title_id \
GROUP BY t.title;'

# Get data from DB
salary_by_title_data = pd.read_sql(sql_query, connection)
salary_by_title_data.head()

                title  Average Salary
0  Assistant Engineer         48564.0
1            Engineer         48535.0
2             Manager         51531.0
3     Senior Engineer         48507.0
4        Senior Staff         58550.0